Merge pull request #1 from iamr1ddl3/readme-polish
docs: polish README
